Jackie-Yang/STM32_Exia/User/GY_86/MS5611/MS5611.h
#ifndef MS5611_H
#define MS5611_H

#include "stm32f10x.h"
	

/**********************宏定义*************************/

//定义器件在IIC总线中的从地址,根据CSB引脚不同修改
//#define MS561101BA_ADDR  0xec   //CBR=1 0x76 I2C address when CSB is connected to HIGH (VCC)
#define MS561101BA_ADDR   0xee   //CBR=0 0x77 I2C address when CSB is connected to LOW (GND)

// 定义MS561101BA内部地址
// registers of the device
#define MS561101BA_D1 0x40
#define MS561101BA_D2 0x50
#define MS561101BA_RESET 0x1E

// D1 and D2 result size (bytes)
#define MS561101BA_D1D2_SIZE 3

// OSR (Over Sampling Ratio) constants
#define MS561101BA_OSR_256 0x00
#define MS561101BA_OSR_512 0x02
#define MS561101BA_OSR_1024 0x04
#define MS561101BA_OSR_2048 0x06
#define MS561101BA_OSR_4096 0x08
//#define  MS561101BA_D1_OSR_256 0x40 
//#define  MS561101BA_D1_OSR_512 0x42 
//#define  MS561101BA_D1_OSR_1024 0x44 
//#define  MS561101BA_D1_OSR_2048 0x46 
#define  MS561101BA_D1_OSR_4096 0x48 

//#define  MS561101BA_D2_OSR_256 0x50 
//#define  MS561101BA_D2_OSR_512 0x52 
//#define  MS561101BA_D2_OSR_1024 0x54 
#define  MS561101BA_D2_OSR_2048 0x56 
#define  MS561101BA_D2_OSR_4096 0x58 

#define MS561101BA_PROM_BASE_ADDR 0xA0 // by adding ints from 0 to 6 we can read all the prom configuration values. 
// C1 will be at 0xA2 and all the subsequent are multiples of 2
#define MS561101BA_PROM_REG_COUNT 6 // number of registers in the PROM
#define MS561101BA_PROM_REG_SIZE 2 // size in bytes of a prom registry.


extern double MS5611_Temperature;
extern double MS5611_Pressure,Zero_Pressure;
extern double MS5611_high;

extern u32 D2_Temp,D1_Pres;	//读取的温度传感器数据 ,读取的气压数据; 


/********************函数声明**************************/
void MS5611_Init(void);			 //芯片初始化，读取芯片中PROM数据
void MS5611_Reset(void);		 //芯片充值
void MS5611_readPROM(void);		 //读取芯片中PROM数据

void MS5611_Read(uint8_t command);	   //向芯片发送读取指令
uint32_t MS5611_Get(void);			   //从芯片中获取测量结果


double MS5611_GetTemperature(void);	   //计算温度结果
void MS5611_GetPressure(void);		   //计算气压结果，并换算成相对高度

 
#endif 
